fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_nvic.h
//*****************************************************************************
//
// hw_nvic.h - Macros used when accessing the NVIC hardware.
//
// Copyright (c) 2005-2020 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision 2.2.0.295 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __HW_NVIC_H__
#define __HW_NVIC_H__

//*****************************************************************************
//
// The following are defines for the NVIC register addresses.
//
//*****************************************************************************
#define NVIC_ACTLR 0xE000E008        // Auxiliary Control
#define NVIC_ST_CTRL \
    0xE000E010                       // SysTick Control and Status
                                     // Register
#define NVIC_ST_RELOAD  0xE000E014   // SysTick Reload Value Register
#define NVIC_ST_CURRENT 0xE000E018   // SysTick Current Value Register
#define NVIC_EN0        0xE000E100   // Interrupt 0-31 Set Enable
#define NVIC_EN1        0xE000E104   // Interrupt 32-63 Set Enable
#define NVIC_EN2        0xE000E108   // Interrupt 64-95 Set Enable
#define NVIC_EN3        0xE000E10C   // Interrupt 96-127 Set Enable
#define NVIC_EN4        0xE000E110   // Interrupt 128-159 Set Enable
#define NVIC_DIS0       0xE000E180   // Interrupt 0-31 Clear Enable
#define NVIC_DIS1       0xE000E184   // Interrupt 32-63 Clear Enable
#define NVIC_DIS2       0xE000E188   // Interrupt 64-95 Clear Enable
#define NVIC_DIS3       0xE000E18C   // Interrupt 96-127 Clear Enable
#define NVIC_DIS4       0xE000E190   // Interrupt 128-159 Clear Enable
#define NVIC_PEND0      0xE000E200   // Interrupt 0-31 Set Pending
#define NVIC_PEND1      0xE000E204   // Interrupt 32-63 Set Pending
#define NVIC_PEND2      0xE000E208   // Interrupt 64-95 Set Pending
#define NVIC_PEND3      0xE000E20C   // Interrupt 96-127 Set Pending
#define NVIC_PEND4      0xE000E210   // Interrupt 128-159 Set Pending
#define NVIC_UNPEND0    0xE000E280   // Interrupt 0-31 Clear Pending
#define NVIC_UNPEND1    0xE000E284   // Interrupt 32-63 Clear Pending
#define NVIC_UNPEND2    0xE000E288   // Interrupt 64-95 Clear Pending
#define NVIC_UNPEND3    0xE000E28C   // Interrupt 96-127 Clear Pending
#define NVIC_UNPEND4    0xE000E290   // Interrupt 128-159 Clear Pending
#define NVIC_ACTIVE0    0xE000E300   // Interrupt 0-31 Active Bit
#define NVIC_ACTIVE1    0xE000E304   // Interrupt 32-63 Active Bit
#define NVIC_ACTIVE2    0xE000E308   // Interrupt 64-95 Active Bit
#define NVIC_ACTIVE3    0xE000E30C   // Interrupt 96-127 Active Bit
#define NVIC_ACTIVE4    0xE000E310   // Interrupt 128-159 Active Bit
#define NVIC_PRI0       0xE000E400   // Interrupt 0-3 Priority
#define NVIC_PRI1       0xE000E404   // Interrupt 4-7 Priority
#define NVIC_PRI2       0xE000E408   // Interrupt 8-11 Priority
#define NVIC_PRI3       0xE000E40C   // Interrupt 12-15 Priority
#define NVIC_PRI4       0xE000E410   // Interrupt 16-19 Priority
#define NVIC_PRI5       0xE000E414   // Interrupt 20-23 Priority
#define NVIC_PRI6       0xE000E418   // Interrupt 24-27 Priority
#define NVIC_PRI7       0xE000E41C   // Interrupt 28-31 Priority
#define NVIC_PRI8       0xE000E420   // Interrupt 32-35 Priority
#define NVIC_PRI9       0xE000E424   // Interrupt 36-39 Priority
#define NVIC_PRI10      0xE000E428   // Interrupt 40-43 Priority
#define NVIC_PRI11      0xE000E42C   // Interrupt 44-47 Priority
#define NVIC_PRI12      0xE000E430   // Interrupt 48-51 Priority
#define NVIC_PRI13      0xE000E434   // Interrupt 52-55 Priority
#define NVIC_PRI14      0xE000E438   // Interrupt 56-59 Priority
#define NVIC_PRI15      0xE000E43C   // Interrupt 60-63 Priority
#define NVIC_PRI16      0xE000E440   // Interrupt 64-67 Priority
#define NVIC_PRI17      0xE000E444   // Interrupt 68-71 Priority
#define NVIC_PRI18      0xE000E448   // Interrupt 72-75 Priority
#define NVIC_PRI19      0xE000E44C   // Interrupt 76-79 Priority
#define NVIC_PRI20      0xE000E450   // Interrupt 80-83 Priority
#define NVIC_PRI21      0xE000E454   // Interrupt 84-87 Priority
#define NVIC_PRI22      0xE000E458   // Interrupt 88-91 Priority
#define NVIC_PRI23      0xE000E45C   // Interrupt 92-95 Priority
#define NVIC_PRI24      0xE000E460   // Interrupt 96-99 Priority
#define NVIC_PRI25      0xE000E464   // Interrupt 100-103 Priority
#define NVIC_PRI26      0xE000E468   // Interrupt 104-107 Priority
#define NVIC_PRI27      0xE000E46C   // Interrupt 108-111 Priority
#define NVIC_PRI28      0xE000E470   // Interrupt 112-115 Priority
#define NVIC_PRI29      0xE000E474   // Interrupt 116-119 Priority
#define NVIC_PRI30      0xE000E478   // Interrupt 120-123 Priority
#define NVIC_PRI31      0xE000E47C   // Interrupt 124-127 Priority
#define NVIC_PRI32      0xE000E480   // Interrupt 128-131 Priority
#define NVIC_PRI33      0xE000E484   // Interrupt 132-135 Priority
#define NVIC_PRI34      0xE000E488   // Interrupt 136-139 Priority
#define NVIC_CPUID      0xE000ED00   // CPU ID Base
#define NVIC_INT_CTRL   0xE000ED04   // Interrupt Control and State
#define NVIC_VTABLE     0xE000ED08   // Vector Table Offset
#define NVIC_APINT \
    0xE000ED0C                       // Application Interrupt and Reset
                                     // Control
#define NVIC_SYS_CTRL     0xE000ED10 // System Control
#define NVIC_CFG_CTRL     0xE000ED14 // Configuration and Control
#define NVIC_SYS_PRI1     0xE000ED18 // System Handler Priority 1
#define NVIC_SYS_PRI2     0xE000ED1C // System Handler Priority 2
#define NVIC_SYS_PRI3     0xE000ED20 // System Handler Priority 3
#define NVIC_SYS_HND_CTRL 0xE000ED24 // System Handler Control and State
#define NVIC_FAULT_STAT   0xE000ED28 // Configurable Fault Status
#define NVIC_HFAULT_STAT  0xE000ED2C // Hard Fault Status
#define NVIC_DEBUG_STAT   0xE000ED30 // Debug Status Register
#define NVIC_MM_ADDR      0xE000ED34 // Memory Management Fault Address
#define NVIC_FAULT_ADDR   0xE000ED38 // Bus Fault Address
#define NVIC_CPAC         0xE000ED88 // Coprocessor Access Control
#define NVIC_MPU_TYPE     0xE000ED90 // MPU Type
#define NVIC_MPU_CTRL     0xE000ED94 // MPU Control
#define NVIC_MPU_NUMBER   0xE000ED98 // MPU Region Number
#define NVIC_MPU_BASE     0xE000ED9C // MPU Region Base Address
#define NVIC_MPU_ATTR     0xE000EDA0 // MPU Region Attribute and Size
#define NVIC_MPU_BASE1    0xE000EDA4 // MPU Region Base Address Alias 1
#define NVIC_MPU_ATTR1 \
    0xE000EDA8                       // MPU Region Attribute and Size
                                     // Alias 1
#define NVIC_MPU_BASE2 0xE000EDAC    // MPU Region Base Address Alias 2
#define NVIC_MPU_ATTR2 \
    0xE000EDB0                       // MPU Region Attribute and Size
                                     // Alias 2
#define NVIC_MPU_BASE3 0xE000EDB4    // MPU Region Base Address Alias 3
#define NVIC_MPU_ATTR3 \
    0xE000EDB8                       // MPU Region Attribute and Size
                                     // Alias 3
#define NVIC_DBG_CTRL 0xE000EDF0     // Debug Control and Status Reg
#define NVIC_DBG_XFER 0xE000EDF4     // Debug Core Reg. Transfer Select
#define NVIC_DBG_DATA 0xE000EDF8     // Debug Core Register Data
#define NVIC_DBG_INT  0xE000EDFC     // Debug Reset Interrupt Control
#define NVIC_SW_TRIG  0xE000EF00     // Software Trigger Interrupt
#define NVIC_FPCC     0xE000EF34     // Floating-Point Context Control
#define NVIC_FPCA     0xE000EF38     // Floating-Point Context Address
#define NVIC_FPDSC \
    0xE000EF3C                       // Floating-Point Default Status
                                     // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTLR register.
//
//*****************************************************************************
#define NVIC_ACTLR_DISOOFP \
    0x00000200                        // Disable Out-Of-Order Floating
                                      // Point
#define NVIC_ACTLR_DISFPCA 0x00000100 // Disable CONTROL
#define NVIC_ACTLR_DISFOLD 0x00000004 // Disable IT Folding
#define NVIC_ACTLR_DISWBUF 0x00000002 // Disable Write Buffer
#define NVIC_ACTLR_DISMCYC \
    0x00000001                        // Disable Interrupts of Multiple
                                      // Cycle Instructions

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ST_CTRL register.
//
//*****************************************************************************
#define NVIC_ST_CTRL_COUNT   0x00010000 // Count Flag
#define NVIC_ST_CTRL_CLK_SRC 0x00000004 // Clock Source
#define NVIC_ST_CTRL_INTEN   0x00000002 // Interrupt Enable
#define NVIC_ST_CTRL_ENABLE  0x00000001 // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ST_RELOAD register.
//
//*****************************************************************************
#define NVIC_ST_RELOAD_M 0x00FFFFFF // Reload Value
#define NVIC_ST_RELOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ST_CURRENT
// register.
//
//*****************************************************************************
#define NVIC_ST_CURRENT_M 0x00FFFFFF // Current Value
#define NVIC_ST_CURRENT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN0 register.
//
//*****************************************************************************
#define NVIC_EN0_INT_M 0xFFFFFFFF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN1 register.
//
//*****************************************************************************
#define NVIC_EN1_INT_M 0xFFFFFFFF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN2 register.
//
//*****************************************************************************
#define NVIC_EN2_INT_M 0xFFFFFFFF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN3 register.
//
//*****************************************************************************
#define NVIC_EN3_INT_M 0xFFFFFFFF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN4 register.
//
//*****************************************************************************
#define NVIC_EN4_INT_M 0x000007FF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS0 register.
//
//*****************************************************************************
#define NVIC_DIS0_INT_M 0xFFFFFFFF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS1 register.
//
//*****************************************************************************
#define NVIC_DIS1_INT_M 0xFFFFFFFF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS2 register.
//
//*****************************************************************************
#define NVIC_DIS2_INT_M 0xFFFFFFFF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS3 register.
//
//*****************************************************************************
#define NVIC_DIS3_INT_M 0xFFFFFFFF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS4 register.
//
//*****************************************************************************
#define NVIC_DIS4_INT_M 0x000007FF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND0 register.
//
//*****************************************************************************
#define NVIC_PEND0_INT_M 0xFFFFFFFF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND1 register.
//
//*****************************************************************************
#define NVIC_PEND1_INT_M 0xFFFFFFFF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND2 register.
//
//*****************************************************************************
#define NVIC_PEND2_INT_M 0xFFFFFFFF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND3 register.
//
//*****************************************************************************
#define NVIC_PEND3_INT_M 0xFFFFFFFF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND4 register.
//
//*****************************************************************************
#define NVIC_PEND4_INT_M 0x000007FF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND0 register.
//
//*****************************************************************************
#define NVIC_UNPEND0_INT_M 0xFFFFFFFF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND1 register.
//
//*****************************************************************************
#define NVIC_UNPEND1_INT_M 0xFFFFFFFF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND2 register.
//
//*****************************************************************************
#define NVIC_UNPEND2_INT_M 0xFFFFFFFF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND3 register.
//
//*****************************************************************************
#define NVIC_UNPEND3_INT_M 0xFFFFFFFF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND4 register.
//
//*****************************************************************************
#define NVIC_UNPEND4_INT_M 0x000007FF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE0 register.
//
//*****************************************************************************
#define NVIC_ACTIVE0_INT_M 0xFFFFFFFF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE1 register.
//
//*****************************************************************************
#define NVIC_ACTIVE1_INT_M 0xFFFFFFFF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE2 register.
//
//*****************************************************************************
#define NVIC_ACTIVE2_INT_M 0xFFFFFFFF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE3 register.
//
//*****************************************************************************
#define NVIC_ACTIVE3_INT_M 0xFFFFFFFF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE4 register.
//
//*****************************************************************************
#define NVIC_ACTIVE4_INT_M 0x000007FF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI0 register.
//
//*****************************************************************************
#define NVIC_PRI0_INT3_M 0xE0000000 // Interrupt 3 Priority Mask
#define NVIC_PRI0_INT2_M 0x00E00000 // Interrupt 2 Priority Mask
#define NVIC_PRI0_INT1_M 0x0000E000 // Interrupt 1 Priority Mask
#define NVIC_PRI0_INT0_M 0x000000E0 // Interrupt 0 Priority Mask
#define NVIC_PRI0_INT3_S 29
#define NVIC_PRI0_INT2_S 21
#define NVIC_PRI0_INT1_S 13
#define NVIC_PRI0_INT0_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI1 register.
//
//*****************************************************************************
#define NVIC_PRI1_INT7_M 0xE0000000 // Interrupt 7 Priority Mask
#define NVIC_PRI1_INT6_M 0x00E00000 // Interrupt 6 Priority Mask
#define NVIC_PRI1_INT5_M 0x0000E000 // Interrupt 5 Priority Mask
#define NVIC_PRI1_INT4_M 0x000000E0 // Interrupt 4 Priority Mask
#define NVIC_PRI1_INT7_S 29
#define NVIC_PRI1_INT6_S 21
#define NVIC_PRI1_INT5_S 13
#define NVIC_PRI1_INT4_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI2 register.
//
//*****************************************************************************
#define NVIC_PRI2_INT11_M 0xE0000000 // Interrupt 11 Priority Mask
#define NVIC_PRI2_INT10_M 0x00E00000 // Interrupt 10 Priority Mask
#define NVIC_PRI2_INT9_M  0x0000E000 // Interrupt 9 Priority Mask
#define NVIC_PRI2_INT8_M  0x000000E0 // Interrupt 8 Priority Mask
#define NVIC_PRI2_INT11_S 29
#define NVIC_PRI2_INT10_S 21
#define NVIC_PRI2_INT9_S  13
#define NVIC_PRI2_INT8_S  5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI3 register.
//
//*****************************************************************************
#define NVIC_PRI3_INT15_M 0xE0000000 // Interrupt 15 Priority Mask
#define NVIC_PRI3_INT14_M 0x00E00000 // Interrupt 14 Priority Mask
#define NVIC_PRI3_INT13_M 0x0000E000 // Interrupt 13 Priority Mask
#define NVIC_PRI3_INT12_M 0x000000E0 // Interrupt 12 Priority Mask
#define NVIC_PRI3_INT15_S 29
#define NVIC_PRI3_INT14_S 21
#define NVIC_PRI3_INT13_S 13
#define NVIC_PRI3_INT12_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI4 register.
//
//*****************************************************************************
#define NVIC_PRI4_INT19_M 0xE0000000 // Interrupt 19 Priority Mask
#define NVIC_PRI4_INT18_M 0x00E00000 // Interrupt 18 Priority Mask
#define NVIC_PRI4_INT17_M 0x0000E000 // Interrupt 17 Priority Mask
#define NVIC_PRI4_INT16_M 0x000000E0 // Interrupt 16 Priority Mask
#define NVIC_PRI4_INT19_S 29
#define NVIC_PRI4_INT18_S 21
#define NVIC_PRI4_INT17_S 13
#define NVIC_PRI4_INT16_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI5 register.
//
//*****************************************************************************
#define NVIC_PRI5_INT23_M 0xE0000000 // Interrupt 23 Priority Mask
#define NVIC_PRI5_INT22_M 0x00E00000 // Interrupt 22 Priority Mask
#define NVIC_PRI5_INT21_M 0x0000E000 // Interrupt 21 Priority Mask
#define NVIC_PRI5_INT20_M 0x000000E0 // Interrupt 20 Priority Mask
#define NVIC_PRI5_INT23_S 29
#define NVIC_PRI5_INT22_S 21
#define NVIC_PRI5_INT21_S 13
#define NVIC_PRI5_INT20_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI6 register.
//
//*****************************************************************************
#define NVIC_PRI6_INT27_M 0xE0000000 // Interrupt 27 Priority Mask
#define NVIC_PRI6_INT26_M 0x00E00000 // Interrupt 26 Priority Mask
#define NVIC_PRI6_INT25_M 0x0000E000 // Interrupt 25 Priority Mask
#define NVIC_PRI6_INT24_M 0x000000E0 // Interrupt 24 Priority Mask
#define NVIC_PRI6_INT27_S 29
#define NVIC_PRI6_INT26_S 21
#define NVIC_PRI6_INT25_S 13
#define NVIC_PRI6_INT24_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI7 register.
//
//*****************************************************************************
#define NVIC_PRI7_INT31_M 0xE0000000 // Interrupt 31 Priority Mask
#define NVIC_PRI7_INT30_M 0x00E00000 // Interrupt 30 Priority Mask
#define NVIC_PRI7_INT29_M 0x0000E000 // Interrupt 29 Priority Mask
#define NVIC_PRI7_INT28_M 0x000000E0 // Interrupt 28 Priority Mask
#define NVIC_PRI7_INT31_S 29
#define NVIC_PRI7_INT30_S 21
#define NVIC_PRI7_INT29_S 13
#define NVIC_PRI7_INT28_S 5

