fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_nvic.h
//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_SYS_HND_CTRL
// register.
//
//*****************************************************************************
#define NVIC_SYS_HND_CTRL_USAGE  0x00040000 // Usage Fault Enable
#define NVIC_SYS_HND_CTRL_BUS    0x00020000 // Bus Fault Enable
#define NVIC_SYS_HND_CTRL_MEM    0x00010000 // Memory Management Fault Enable
#define NVIC_SYS_HND_CTRL_SVC    0x00008000 // SVC Call Pending
#define NVIC_SYS_HND_CTRL_BUSP   0x00004000 // Bus Fault Pending
#define NVIC_SYS_HND_CTRL_MEMP   0x00002000 // Memory Management Fault Pending
#define NVIC_SYS_HND_CTRL_USAGEP 0x00001000 // Usage Fault Pending
#define NVIC_SYS_HND_CTRL_TICK   0x00000800 // SysTick Exception Active
#define NVIC_SYS_HND_CTRL_PNDSV  0x00000400 // PendSV Exception Active
#define NVIC_SYS_HND_CTRL_MON    0x00000100 // Debug Monitor Active
#define NVIC_SYS_HND_CTRL_SVCA   0x00000080 // SVC Call Active
#define NVIC_SYS_HND_CTRL_USGA   0x00000008 // Usage Fault Active
#define NVIC_SYS_HND_CTRL_BUSA   0x00000002 // Bus Fault Active
#define NVIC_SYS_HND_CTRL_MEMA   0x00000001 // Memory Management Fault Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_FAULT_STAT
// register.
//
//*****************************************************************************
#define NVIC_FAULT_STAT_DIV0    0x02000000 // Divide-by-Zero Usage Fault
#define NVIC_FAULT_STAT_UNALIGN 0x01000000 // Unaligned Access Usage Fault
#define NVIC_FAULT_STAT_NOCP    0x00080000 // No Coprocessor Usage Fault
#define NVIC_FAULT_STAT_INVPC   0x00040000 // Invalid PC Load Usage Fault
#define NVIC_FAULT_STAT_INVSTAT 0x00020000 // Invalid State Usage Fault
#define NVIC_FAULT_STAT_UNDEF \
    0x00010000                             // Undefined Instruction Usage
                                           // Fault
#define NVIC_FAULT_STAT_BFARV 0x00008000   // Bus Fault Address Register Valid
#define NVIC_FAULT_STAT_BLSPERR \
    0x00002000                             // Bus Fault on Floating-Point Lazy
                                           // State Preservation
#define NVIC_FAULT_STAT_BSTKE   0x00001000 // Stack Bus Fault
#define NVIC_FAULT_STAT_BUSTKE  0x00000800 // Unstack Bus Fault
#define NVIC_FAULT_STAT_IMPRE   0x00000400 // Imprecise Data Bus Error
#define NVIC_FAULT_STAT_PRECISE 0x00000200 // Precise Data Bus Error
#define NVIC_FAULT_STAT_IBUS    0x00000100 // Instruction Bus Error
#define NVIC_FAULT_STAT_MMARV \
    0x00000080                             // Memory Management Fault Address
                                           // Register Valid
#define NVIC_FAULT_STAT_MLSPERR \
    0x00000020                             // Memory Management Fault on
                                           // Floating-Point Lazy State
                                           // Preservation
#define NVIC_FAULT_STAT_MSTKE  0x00000010  // Stack Access Violation
#define NVIC_FAULT_STAT_MUSTKE 0x00000008  // Unstack Access Violation
#define NVIC_FAULT_STAT_DERR   0x00000002  // Data Access Violation
#define NVIC_FAULT_STAT_IERR   0x00000001  // Instruction Access Violation

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_HFAULT_STAT
// register.
//
//*****************************************************************************
#define NVIC_HFAULT_STAT_DBG    0x80000000 // Debug Event
#define NVIC_HFAULT_STAT_FORCED 0x40000000 // Forced Hard Fault
#define NVIC_HFAULT_STAT_VECT   0x00000002 // Vector Table Read Fault

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DEBUG_STAT
// register.
//
//*****************************************************************************
#define NVIC_DEBUG_STAT_EXTRNL  0x00000010 // EDBGRQ asserted
#define NVIC_DEBUG_STAT_VCATCH  0x00000008 // Vector catch
#define NVIC_DEBUG_STAT_DWTTRAP 0x00000004 // DWT match
#define NVIC_DEBUG_STAT_BKPT    0x00000002 // Breakpoint instruction
#define NVIC_DEBUG_STAT_HALTED  0x00000001 // Halt request

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MM_ADDR register.
//
//*****************************************************************************
#define NVIC_MM_ADDR_M 0xFFFFFFFF // Fault Address
#define NVIC_MM_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_FAULT_ADDR
// register.
//
//*****************************************************************************
#define NVIC_FAULT_ADDR_M 0xFFFFFFFF // Fault Address
#define NVIC_FAULT_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_CPAC register.
//
//*****************************************************************************
#define NVIC_CPAC_CP11_M \
    0x00C00000                         // CP11 Coprocessor Access
                                       // Privilege
#define NVIC_CPAC_CP11_DIS  0x00000000 // Access Denied
#define NVIC_CPAC_CP11_PRIV 0x00400000 // Privileged Access Only
#define NVIC_CPAC_CP11_FULL 0x00C00000 // Full Access
#define NVIC_CPAC_CP10_M \
    0x00300000                         // CP10 Coprocessor Access
                                       // Privilege
#define NVIC_CPAC_CP10_DIS  0x00000000 // Access Denied
#define NVIC_CPAC_CP10_PRIV 0x00100000 // Privileged Access Only
#define NVIC_CPAC_CP10_FULL 0x00300000 // Full Access

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_TYPE register.
//
//*****************************************************************************
#define NVIC_MPU_TYPE_IREGION_M 0x00FF0000 // Number of I Regions
#define NVIC_MPU_TYPE_DREGION_M 0x0000FF00 // Number of D Regions
#define NVIC_MPU_TYPE_SEPARATE  0x00000001 // Separate or Unified MPU
#define NVIC_MPU_TYPE_IREGION_S 16
#define NVIC_MPU_TYPE_DREGION_S 8

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_CTRL register.
//
//*****************************************************************************
#define NVIC_MPU_CTRL_PRIVDEFEN 0x00000004 // MPU Default Region
#define NVIC_MPU_CTRL_HFNMIENA  0x00000002 // MPU Enabled During Faults
#define NVIC_MPU_CTRL_ENABLE    0x00000001 // MPU Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_NUMBER
// register.
//
//*****************************************************************************
#define NVIC_MPU_NUMBER_M 0x00000007 // MPU Region to Access
#define NVIC_MPU_NUMBER_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_BASE register.
//
//*****************************************************************************
#define NVIC_MPU_BASE_ADDR_M   0xFFFFFFE0 // Base Address Mask
#define NVIC_MPU_BASE_VALID    0x00000010 // Region Number Valid
#define NVIC_MPU_BASE_REGION_M 0x00000007 // Region Number
#define NVIC_MPU_BASE_ADDR_S   5
#define NVIC_MPU_BASE_REGION_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_ATTR register.
//
//*****************************************************************************
#define NVIC_MPU_ATTR_XN        0x10000000 // Instruction Access Disable
#define NVIC_MPU_ATTR_AP_M      0x07000000 // Access Privilege
#define NVIC_MPU_ATTR_AP_NO_NO  0x00000000 // prv: no access, usr: no access
#define NVIC_MPU_ATTR_AP_RW_NO  0x01000000 // prv: rw, usr: none
#define NVIC_MPU_ATTR_AP_RW_RO  0x02000000 // prv: rw, usr: read-only
#define NVIC_MPU_ATTR_AP_RW_RW  0x03000000 // prv: rw, usr: rw
#define NVIC_MPU_ATTR_AP_RO_NO  0x05000000 // prv: ro, usr: none
#define NVIC_MPU_ATTR_AP_RO_RO  0x06000000 // prv: ro, usr: ro
#define NVIC_MPU_ATTR_TEX_M     0x00380000 // Type Extension Mask
#define NVIC_MPU_ATTR_SHAREABLE 0x00040000 // Shareable
#define NVIC_MPU_ATTR_CACHEABLE 0x00020000 // Cacheable
#define NVIC_MPU_ATTR_BUFFRABLE 0x00010000 // Bufferable
#define NVIC_MPU_ATTR_SRD_M     0x0000FF00 // Subregion Disable Bits
#define NVIC_MPU_ATTR_SRD_0     0x00000100 // Sub-region 0 disable
#define NVIC_MPU_ATTR_SRD_1     0x00000200 // Sub-region 1 disable
#define NVIC_MPU_ATTR_SRD_2     0x00000400 // Sub-region 2 disable
#define NVIC_MPU_ATTR_SRD_3     0x00000800 // Sub-region 3 disable
#define NVIC_MPU_ATTR_SRD_4     0x00001000 // Sub-region 4 disable
#define NVIC_MPU_ATTR_SRD_5     0x00002000 // Sub-region 5 disable
#define NVIC_MPU_ATTR_SRD_6     0x00004000 // Sub-region 6 disable
#define NVIC_MPU_ATTR_SRD_7     0x00008000 // Sub-region 7 disable
#define NVIC_MPU_ATTR_SIZE_M    0x0000003E // Region Size Mask
#define NVIC_MPU_ATTR_SIZE_32B  0x00000008 // Region size 32 bytes
#define NVIC_MPU_ATTR_SIZE_64B  0x0000000A // Region size 64 bytes
#define NVIC_MPU_ATTR_SIZE_128B 0x0000000C // Region size 128 bytes
#define NVIC_MPU_ATTR_SIZE_256B 0x0000000E // Region size 256 bytes
#define NVIC_MPU_ATTR_SIZE_512B 0x00000010 // Region size 512 bytes
#define NVIC_MPU_ATTR_SIZE_1K   0x00000012 // Region size 1 Kbytes
#define NVIC_MPU_ATTR_SIZE_2K   0x00000014 // Region size 2 Kbytes
#define NVIC_MPU_ATTR_SIZE_4K   0x00000016 // Region size 4 Kbytes
#define NVIC_MPU_ATTR_SIZE_8K   0x00000018 // Region size 8 Kbytes
#define NVIC_MPU_ATTR_SIZE_16K  0x0000001A // Region size 16 Kbytes
#define NVIC_MPU_ATTR_SIZE_32K  0x0000001C // Region size 32 Kbytes
#define NVIC_MPU_ATTR_SIZE_64K  0x0000001E // Region size 64 Kbytes
#define NVIC_MPU_ATTR_SIZE_128K 0x00000020 // Region size 128 Kbytes
#define NVIC_MPU_ATTR_SIZE_256K 0x00000022 // Region size 256 Kbytes
#define NVIC_MPU_ATTR_SIZE_512K 0x00000024 // Region size 512 Kbytes
#define NVIC_MPU_ATTR_SIZE_1M   0x00000026 // Region size 1 Mbytes
#define NVIC_MPU_ATTR_SIZE_2M   0x00000028 // Region size 2 Mbytes
#define NVIC_MPU_ATTR_SIZE_4M   0x0000002A // Region size 4 Mbytes
#define NVIC_MPU_ATTR_SIZE_8M   0x0000002C // Region size 8 Mbytes
#define NVIC_MPU_ATTR_SIZE_16M  0x0000002E // Region size 16 Mbytes
#define NVIC_MPU_ATTR_SIZE_32M  0x00000030 // Region size 32 Mbytes
#define NVIC_MPU_ATTR_SIZE_64M  0x00000032 // Region size 64 Mbytes
#define NVIC_MPU_ATTR_SIZE_128M 0x00000034 // Region size 128 Mbytes
#define NVIC_MPU_ATTR_SIZE_256M 0x00000036 // Region size 256 Mbytes
#define NVIC_MPU_ATTR_SIZE_512M 0x00000038 // Region size 512 Mbytes
#define NVIC_MPU_ATTR_SIZE_1G   0x0000003A // Region size 1 Gbytes
#define NVIC_MPU_ATTR_SIZE_2G   0x0000003C // Region size 2 Gbytes
#define NVIC_MPU_ATTR_SIZE_4G   0x0000003E // Region size 4 Gbytes
#define NVIC_MPU_ATTR_ENABLE    0x00000001 // Region Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_BASE1 register.
//
//*****************************************************************************
#define NVIC_MPU_BASE1_ADDR_M   0xFFFFFFE0 // Base Address Mask
#define NVIC_MPU_BASE1_VALID    0x00000010 // Region Number Valid
#define NVIC_MPU_BASE1_REGION_M 0x00000007 // Region Number
#define NVIC_MPU_BASE1_ADDR_S   5
#define NVIC_MPU_BASE1_REGION_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_ATTR1 register.
//
//*****************************************************************************
#define NVIC_MPU_ATTR1_XN        0x10000000 // Instruction Access Disable
#define NVIC_MPU_ATTR1_AP_M      0x07000000 // Access Privilege
#define NVIC_MPU_ATTR1_TEX_M     0x00380000 // Type Extension Mask
#define NVIC_MPU_ATTR1_SHAREABLE 0x00040000 // Shareable
#define NVIC_MPU_ATTR1_CACHEABLE 0x00020000 // Cacheable
#define NVIC_MPU_ATTR1_BUFFRABLE 0x00010000 // Bufferable
#define NVIC_MPU_ATTR1_SRD_M     0x0000FF00 // Subregion Disable Bits
#define NVIC_MPU_ATTR1_SIZE_M    0x0000003E // Region Size Mask
#define NVIC_MPU_ATTR1_ENABLE    0x00000001 // Region Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_BASE2 register.
//
//*****************************************************************************
#define NVIC_MPU_BASE2_ADDR_M   0xFFFFFFE0 // Base Address Mask
#define NVIC_MPU_BASE2_VALID    0x00000010 // Region Number Valid
#define NVIC_MPU_BASE2_REGION_M 0x00000007 // Region Number
#define NVIC_MPU_BASE2_ADDR_S   5
#define NVIC_MPU_BASE2_REGION_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_ATTR2 register.
//
//*****************************************************************************
#define NVIC_MPU_ATTR2_XN        0x10000000 // Instruction Access Disable
#define NVIC_MPU_ATTR2_AP_M      0x07000000 // Access Privilege
#define NVIC_MPU_ATTR2_TEX_M     0x00380000 // Type Extension Mask
#define NVIC_MPU_ATTR2_SHAREABLE 0x00040000 // Shareable
#define NVIC_MPU_ATTR2_CACHEABLE 0x00020000 // Cacheable
#define NVIC_MPU_ATTR2_BUFFRABLE 0x00010000 // Bufferable
#define NVIC_MPU_ATTR2_SRD_M     0x0000FF00 // Subregion Disable Bits
#define NVIC_MPU_ATTR2_SIZE_M    0x0000003E // Region Size Mask
#define NVIC_MPU_ATTR2_ENABLE    0x00000001 // Region Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_BASE3 register.
//
//*****************************************************************************
#define NVIC_MPU_BASE3_ADDR_M   0xFFFFFFE0 // Base Address Mask
#define NVIC_MPU_BASE3_VALID    0x00000010 // Region Number Valid
#define NVIC_MPU_BASE3_REGION_M 0x00000007 // Region Number
#define NVIC_MPU_BASE3_ADDR_S   5
#define NVIC_MPU_BASE3_REGION_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MPU_ATTR3 register.
//
//*****************************************************************************
#define NVIC_MPU_ATTR3_XN        0x10000000 // Instruction Access Disable
#define NVIC_MPU_ATTR3_AP_M      0x07000000 // Access Privilege
#define NVIC_MPU_ATTR3_TEX_M     0x00380000 // Type Extension Mask
#define NVIC_MPU_ATTR3_SHAREABLE 0x00040000 // Shareable
#define NVIC_MPU_ATTR3_CACHEABLE 0x00020000 // Cacheable
#define NVIC_MPU_ATTR3_BUFFRABLE 0x00010000 // Bufferable
#define NVIC_MPU_ATTR3_SRD_M     0x0000FF00 // Subregion Disable Bits
#define NVIC_MPU_ATTR3_SIZE_M    0x0000003E // Region Size Mask
#define NVIC_MPU_ATTR3_ENABLE    0x00000001 // Region Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DBG_CTRL register.
//
//*****************************************************************************
#define NVIC_DBG_CTRL_DBGKEY_M   0xFFFF0000  // Debug key mask
#define NVIC_DBG_CTRL_DBGKEY     0xA05F0000  // Debug key
#define NVIC_DBG_CTRL_S_RESET_ST 0x02000000  // Core has reset since last read
#define NVIC_DBG_CTRL_S_RETIRE_ST \
    0x01000000                               // Core has executed insruction
                                             // since last read
#define NVIC_DBG_CTRL_S_LOCKUP    0x00080000 // Core is locked up
#define NVIC_DBG_CTRL_S_SLEEP     0x00040000 // Core is sleeping
#define NVIC_DBG_CTRL_S_HALT      0x00020000 // Core status on halt
#define NVIC_DBG_CTRL_S_REGRDY    0x00010000 // Register read/write available
#define NVIC_DBG_CTRL_C_SNAPSTALL 0x00000020 // Breaks a stalled load/store
#define NVIC_DBG_CTRL_C_MASKINT   0x00000008 // Mask interrupts when stepping
#define NVIC_DBG_CTRL_C_STEP      0x00000004 // Step the core
#define NVIC_DBG_CTRL_C_HALT      0x00000002 // Halt the core
#define NVIC_DBG_CTRL_C_DEBUGEN   0x00000001 // Enable debug

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DBG_XFER register.
//
//*****************************************************************************
#define NVIC_DBG_XFER_REG_WNR   0x00010000 // Write or not read
#define NVIC_DBG_XFER_REG_SEL_M 0x0000001F // Register
#define NVIC_DBG_XFER_REG_R0    0x00000000 // Register R0
#define NVIC_DBG_XFER_REG_R1    0x00000001 // Register R1
#define NVIC_DBG_XFER_REG_R2    0x00000002 // Register R2
#define NVIC_DBG_XFER_REG_R3    0x00000003 // Register R3
#define NVIC_DBG_XFER_REG_R4    0x00000004 // Register R4
#define NVIC_DBG_XFER_REG_R5    0x00000005 // Register R5
#define NVIC_DBG_XFER_REG_R6    0x00000006 // Register R6
#define NVIC_DBG_XFER_REG_R7    0x00000007 // Register R7
#define NVIC_DBG_XFER_REG_R8    0x00000008 // Register R8
#define NVIC_DBG_XFER_REG_R9    0x00000009 // Register R9
#define NVIC_DBG_XFER_REG_R10   0x0000000A // Register R10
#define NVIC_DBG_XFER_REG_R11   0x0000000B // Register R11
#define NVIC_DBG_XFER_REG_R12   0x0000000C // Register R12
#define NVIC_DBG_XFER_REG_R13   0x0000000D // Register R13
#define NVIC_DBG_XFER_REG_R14   0x0000000E // Register R14
#define NVIC_DBG_XFER_REG_R15   0x0000000F // Register R15
#define NVIC_DBG_XFER_REG_FLAGS 0x00000010 // xPSR/Flags register
#define NVIC_DBG_XFER_REG_MSP   0x00000011 // Main SP
#define NVIC_DBG_XFER_REG_PSP   0x00000012 // Process SP
#define NVIC_DBG_XFER_REG_DSP   0x00000013 // Deep SP
#define NVIC_DBG_XFER_REG_CFBP  0x00000014 // Control/Fault/BasePri/PriMask

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DBG_DATA register.
//
//*****************************************************************************
#define NVIC_DBG_DATA_M 0xFFFFFFFF // Data temporary cache
#define NVIC_DBG_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DBG_INT register.
//
//*****************************************************************************
#define NVIC_DBG_INT_HARDERR    0x00000400 // Debug trap on hard fault
#define NVIC_DBG_INT_INTERR     0x00000200 // Debug trap on interrupt errors
#define NVIC_DBG_INT_BUSERR     0x00000100 // Debug trap on bus error
#define NVIC_DBG_INT_STATERR    0x00000080 // Debug trap on usage fault state
#define NVIC_DBG_INT_CHKERR     0x00000040 // Debug trap on usage fault check
#define NVIC_DBG_INT_NOCPERR    0x00000020 // Debug trap on coprocessor error
#define NVIC_DBG_INT_MMERR      0x00000010 // Debug trap on mem manage fault
#define NVIC_DBG_INT_RESET      0x00000008 // Core reset status
#define NVIC_DBG_INT_RSTPENDCLR 0x00000004 // Clear pending core reset
#define NVIC_DBG_INT_RSTPENDING 0x00000002 // Core reset is pending
#define NVIC_DBG_INT_RSTVCATCH  0x00000001 // Reset vector catch

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_SW_TRIG register.
//
//*****************************************************************************
#define NVIC_SW_TRIG_INTID_M 0x000000FF // Interrupt ID
#define NVIC_SW_TRIG_INTID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_FPCC register.
//
//*****************************************************************************
#define NVIC_FPCC_ASPEN \
    0x80000000                      // Automatic State Preservation
                                    // Enable
#define NVIC_FPCC_LSPEN  0x40000000 // Lazy State Preservation Enable
#define NVIC_FPCC_MONRDY 0x00000100 // Monitor Ready
#define NVIC_FPCC_BFRDY  0x00000040 // Bus Fault Ready
#define NVIC_FPCC_MMRDY  0x00000020 // Memory Management Fault Ready
#define NVIC_FPCC_HFRDY  0x00000010 // Hard Fault Ready
#define NVIC_FPCC_THREAD 0x00000008 // Thread Mode
#define NVIC_FPCC_USER   0x00000002 // User Privilege Level
#define NVIC_FPCC_LSPACT 0x00000001 // Lazy State Preservation Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_FPCA register.
//
//*****************************************************************************
#define NVIC_FPCA_ADDRESS_M 0xFFFFFFF8 // Address
#define NVIC_FPCA_ADDRESS_S 3

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_FPDSC register.
//
//*****************************************************************************
#define NVIC_FPDSC_AHP      0x04000000 // AHP Bit Default
#define NVIC_FPDSC_DN       0x02000000 // DN Bit Default
#define NVIC_FPDSC_FZ       0x01000000 // FZ Bit Default
#define NVIC_FPDSC_RMODE_M  0x00C00000 // RMODE Bit Default
#define NVIC_FPDSC_RMODE_RN 0x00000000 // Round to Nearest (RN) mode
#define NVIC_FPDSC_RMODE_RP \
    0x00400000                         // Round towards Plus Infinity (RP)
                                       // mode
#define NVIC_FPDSC_RMODE_RM \
    0x00800000                         // Round towards Minus Infinity
                                       // (RM) mode
#define NVIC_FPDSC_RMODE_RZ 0x00C00000 // Round towards Zero (RZ) mode

#endif                                 // __HW_NVIC_H__
